Repository: sheilagomes/wp-trad
Catalog: tm/GNOME_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The register function hasn't been found automatically in the following pretty printer files: %s You need to fill yourself the register function columns before enabling the rows. Most of the time the register function name contains the word "register".
pt_br: A função de registro não foi automaticamente localizada dentro do(s) seguinte(s) arquivo(s) "pretty printer": %s Você tem quem preencher manualmente a coluna "Função de registro" antes de ativar uma linha. Na maioria das vezes, o nome da função de registro contém a palavra "register".

source: Select a pretty printer file
pt_br: Escolha um arquivo pretty printer

source: Activate
pt_br: AtivoRegister Function

source: Register Function
pt_br: Função de registro

source: Gdb Debugger
pt_br: Depurador Gdb

source: Unable to extract project template %s: %s
pt_br: Não foi possível extrair o modelo de projeto %s: %s

source: Required Packages:
pt_br: Pacotes necessários:

source: Check the packages that your project requires
pt_br: Escolha os pacotes que seu projeto precisa

source: PyGTK project using automake
pt_br: Projeto PyGTK usando automake

source: _Run
pt_br: E_xecutar

source: Snippets
pt_br: Trechos

source: _Trigger insert
pt_br: Inserir pelo _disparador

source: Insert a snippet using the trigger-key
pt_br: Insere um trecho usando a tecla disparadora

source: _Auto complete insert
pt_br: Inserir pelo completamento automático

source: Insert a snippet using auto-completion
pt_br: Insere um trecho usando o completamento automático

source: _Import snippets …
pt_br: _Importar trechos …

source: Import snippets to the database
pt_br: Importa trechos para o banco de dados

source: _Export snippets …
pt_br: _Exportar trechos …

source: Export snippets from the database
pt_br: Exporta os trechos do banco de dados

source: Snippets Manager actions
pt_br: Ações do gerenciador de trechos

source: Command?
pt_br: Comando?

source: Variable text
pt_br: Texto (variável)

source: Instant value
pt_br: Valor instantâneo

source: Code Snippets
pt_br: Trechos de códigos

source: Trigger
pt_br: Disparador

source: Languages
pt_br: Linguagens

source: Add Snippet …
pt_br: Adicionar trecho …

source: Add Snippets Group …
pt_br: Adicionar grupo de trecho …

source: Default value
pt_br: Valor padrão

source: Error: You must choose at least one language for the snippet!
pt_br: Erro: Você deve escolher pelo menos uma linguagem para este trecho!

source: Error: The trigger key is already in use for one of the languages!
pt_br: Erro: Este disparador já está em uso em alguma linguagem!

source: Error: The trigger key can only contain alphanumeric characters and _ !
pt_br: Erro: O disparador só pode ter caracteres alfa-numéricos e _ !

source: Error: You haven't entered a trigger key for the snippet!
pt_br: Erro: Você não digitou um disparador para este trecho!

source: Snippet Name:
pt_br: Nome do trecho:

source: Select the name of the Snippet. The role of the name is purely informative.
pt_br: Escolha o nome do trecho. Não existe regra, isso é meramente informativo.

source: Warning: You should choose a name for the snippet!
pt_br: Aviso: Você deveria dar um nome para este trecho!

source: Snippets Group:
pt_br: Grupo do trecho:

source: Select the Snippets Group to which this snippet belongs.
pt_br: Escolha o grupo de trechos que este trecho pertence.

source: Error: The snippet must belong to a group!
pt_br: Erro: O trecho deve pertencer a um grupo!

source: Trigger Key:
pt_br: Disparador:

source: The trigger key is used for fast insertion of the snippet. Type the trigger key in the editor, followed by the "Fast Insert" shortcut to insert a snippet. Warning: Must be unique per language.
pt_br: O disparador é usado para a inserção rápida do trecho. Digite o disparador no editor, e, em seguida execute o atalho "Inserir pelo disparador". Aviso: Deve ser único por linguagem.

source: Languages:
pt_br: Linguagens:

source: Select the languages for which you want to use this snippet.
pt_br: Escolha as linguagens que você que usar neste trecho.

source: Keywords:
pt_br: Palavras-chave:

source: Keywords are used for better searching of the snippets. They should be relevant to the snippet content. Type them separated by a single space.
pt_br: Palavras-chave são usadas para facilitar a busca. Elas devem ser relevantes ao conteúdo do trecho. Digite-as separadas por um espaço em branco.

source: Snippet Properties
pt_br: Propriedades do trecho

source: Snippet Content
pt_br: Conteúdo do trecho

source: Add
pt_br: Adicionar

source: Snippet Variables
pt_br: Variáveis do trecho

source: Close
pt_br: Fechar

source: Anjuta variables
pt_br: Variáveis do Anjuta

source: Import Snippets
pt_br: Importar trechos

source: Export Snippets
pt_br: Exportar trechos

source: Unable to execute command
pt_br: Não foi possível executar o comando

source: Python support warning
pt_br: Aviso do suporte à Python

source: Either python path is wrong or python-rope (http://rope.sf.net) libraries aren't installed. Both are required for autocompletion in python files. Please install them and check the python path in the preferences.
pt_br: Ou o caminho para o python está errado, ou a biblioteca python-rope (http://rope.sf.net) não está instalada. Ambos são necessários para a completação automática em arquivos python. Instale-a e verifique o caminho para o python nas preferências.

source: Do not show that warning again
pt_br: Não mostrar este aviso novamente

source: Python Assistance
pt_br: Assistente do Python

source: Interpreter
pt_br: Interpretador

source: Environment
pt_br: Ambiente:

source: Allows insertion of snippets into the editor.
pt_br: Insere trechos de códigos.

source: Thai
pt_br: Tailandês

source: [Pp]assword.*:
pt_br: ([Pp]assword.*:_BAR_[Ss]enha:)

source: Help text
pt_br: Texto de ajuda

source: Text to show the user what to enter into the entry
pt_br: Texto para mostrar ao usuário o que digitar no campo

source: Path that dropped files should be relative to
pt_br: O caminho ao qual os arquivos arrastados deveriam ser relativos

source: Drop a file or enter a path here
pt_br: Solte um arquivo ou digite um caminho aqui

source: Select Files
pt_br: Selecionar arquivos

source: Path that all files in the list should be relative to
pt_br: Caminho ao qual todos os arquivos da lista serão relativos

source: Show Add button
pt_br: Mostrar botão Adicionar

source: Display an Add button
pt_br: Exibe um botão Adicionar

source: Group name can only contain alphanumeric or "#$:%+,-.=@^_`~" characters
pt_br: O nome do grupo só pode conter caracteres alfanuméricos e um dos "#$:%+,-.=@^_`~".

source: Target name can only contain alphanumeric, '_', '-', '/' or '.' characters
pt_br: O nome do alvo deve conter somente caracteres alfanuméricos, '_', '-', '/' e '.'

source: Highlight build warnings and errors in editor
pt_br: Destacar os avisos e erros de compilação no editor

source: warning:-old
pt_br: warning:

source: error:-old
pt_br: error:

source: Error while setting up build environment: %s
pt_br: Erro ao configurar o ambiente de compilação: %s

source: Class Methods
pt_br: Métodos da classe

source: Constants/Variables
pt_br: Constantes/Variáveis

source: Python Class
pt_br: Classe Python

source: is Sub-Class
pt_br: é Subclasse

source: Initializer Arguments:
pt_br: Argumentos do inicializador:

source: Methods
pt_br: Métodos

source: Imports
pt_br: Importações

source: JavaScript Class
pt_br: Classe JavaScript

source: GLib.Object
pt_br: Objeto GLib

source: Class Scope:
pt_br: Escopo da classe:

source: Vala Class
pt_br: Classe Vala

source: Flags
pt_br: Sinalizadores

source: Setter
pt_br: Definidor

source: Enable CLang code analyzer
pt_br: Habilitar analisador de código CLang

source: The project needs to be reconfigured after enabling this option. Please run Build->Configure!
pt_br: O projeto precisa ser reconfigurado depois de habilitar esta opção. Por favor, execute Compilar->Configurar projeto!

source: ccc-analyzer:
pt_br: analisador-ccc:

source: c++-analyzer:
pt_br: analisador c++:

source: CLang Paths
pt_br: Caminhos de CLang

source: Couldn't find clang analyzer, please check if it is installed and if the paths are configured correctly in the preferences
pt_br: Não foi possível localizar o analisador clang. Por favor, verifique se está instalado e se os caminhos estão configurados corretamente nas Preferências

source: CLang Analyzer
pt_br: Analisador CLang

source: Close Others
pt_br: Fechar os outros

source: Search for next appearance of term.
pt_br: Busca pela próxima aparição do termo.

source: Search and replace
pt_br: Pesquisa e substitui

source: Clear Highlight
pt_br: Limpar realces

source: Clear all highlighted text
pt_br: Retira todos os realces de texto

source: Case Sensitive
pt_br: Sensível à maiusculização

source: Match case in search results.
pt_br: Compara a maiusculização nos resultados da busca.

source: Highlight All
pt_br: Realçar tudo

source: Highlight all occurrences
pt_br: Realçar todas as ocorrências

source: Search using regular expressions
pt_br: Pesquisa usando expressões regulares

source: Toggle bookmark at the current line position
pt_br: Alterna se há ou não um marcador na posição da linha atual

source: Toggle search options
pt_br: Alternar opções de busca

source: OVR
pt_br: SOBR

source: Search for "%s" reached the end and wrapped around.
pt_br: A pesquisa por "%s" chegou ao fim e recomeçou do início do documento.

source: Search for "%s" reached the end and wrapped around but no new match was found.
pt_br: A pesquisa por "%s" chegou ao fim do documento e recomeçou do início, mas nenhuma nova ocorrência foi encontrada.

source: Search for "%s" reached top and was continued at the bottom.
pt_br: A pesquisa por "%s" chegou ao começo e recomeçou do fim do documento.

source: Search for "%s" reached top and was continued at the bottom but no new match was found.
pt_br: A pesquisa por "%s" chegou ao início e recomeçou do fim do documento, mas nenhuma nova ocorrência foi encontrada.

source: Replace all
pt_br: Substituir tudo

source: Vala Source File
pt_br: Arquivos de código fonte em Vala

source: BSD Public License
pt_br: Licença pública BSD

source: Missing name
pt_br: Falta o nome

source: Group
pt_br: Grupo

source: Project doesn't allow to set properties
pt_br: O projeto não permite definir propriedades

source: Package
pt_br: Pacote

source: Unable to parse project file
pt_br: Impossível analisar o arquivo do projeto

source: Project name, it can contain spaces by example 'GNU Autoconf'
pt_br: Nome do projeto; ele pode conter espaços como em "GNU Autoconf"

source: Project version, typically a few numbers separated by dot by example '1.0.0'
pt_br: Versão do projeto; tipicamente alguns números separados por ponto como "1.0.0"

source: Bug report URL:
pt_br: URL para relato de erros:

source: An email address or a link to a web page where the user can report bug. It is optional.
pt_br: Um endereço de e-mail ou um link para uma página web onde o usuário pode relatar um problema. É opcional.

source: Package name, it can contains only alphanumerics and underscore characters.It is generated from the project name if not provided.
pt_br: Nome do pacote; pode conter apenas caracteres alfanuméricos e sublinha. É gerado a partir do nome do projeto se não for fornecido.

source: An link to the project web page if provided.
pt_br: Um link para a página web do projeto se fornecida.

source: Common additional linker flags for all targets in this group.
pt_br: Sinalizadores adicionais para o vinculador comum a todos os alvos neste grupo.

source: Common additional C preprocessor flags for all targets in this group.
pt_br: Sinalizadores adicionais para o pré-processador C comum a todos os alvos neste grupo.

source: Common additional C compiler flags for all targets in this group.
pt_br: Sinalizadores adicionais para o compilador C comum a todos os alvos neste grupo.

source: Common additional C++ compiler flags for all targets in this group.
pt_br: Sinalizadores adicionais para o compilador C++ comum a todos os alvos neste grupo.

source: Java compiler flags:
pt_br: Sinalizadores do compilador Java:

source: Common additional Java compiler flags for all targets in this group.
pt_br: Sinalizadores adicionais para o compilador Java comum a todos os alvos neste grupo.

source: Vala compiler flags:
pt_br: Sinalizadores do compilador Vala:

source: Common additional Vala compiler flags for all targets in this group.
pt_br: Sinalizadores adicionais para o compilador Vala comum a todos os alvos neste grupo.

source: Common additional Fortran compiler flags for all targets in this group.
pt_br: Sinalizadores adicionais para o compilador Fortran comum a todos os alvos neste grupo.

source: Objective C compiler flags:
pt_br: Sinalizadores do compilador Objective C:

source: Common additional Objective C compiler flags for all targets in this group.
pt_br: Sinalizadores adicionais para o compilador Objective C comum a todos os alvos neste grupo.

source: Lex/Flex flags:
pt_br: Sinalizadores do Lex/Flex:

source: Common additional Lex or Flex lexical analyser generator flags for all targets in this group.
pt_br: Sinalizadores adicionais para o gerador de analisador léxico Lex ou Flex comum a todos os alvos neste grupo.

source: Yacc/Bison flags:
pt_br: Sinalizadores do Yacc/Bison:

source: Common additional Yacc or Bison parser generator flags for all targets in this group.
pt_br: Sinalizadores adicionais para o gerador de analisador Yacc ou Bison comum a todos os alvos neste grupo.

source: Installation directories:
pt_br: Diretórios de instalação:

source: List of custom installation directories used by targets in this group.
pt_br: Lista de diretórios de instalação personalizados usado pelos alvos neste grupo.

source: Do not install:
pt_br: Não instalar:

source: Build but do not install the target.
pt_br: Compila, mas não instala o alvo.

source: Installation directory:
pt_br: Diretório de instalação:

source: It has to be a standard directory or a custom one defined in group properties.
pt_br: Tem que ser um diretório padrão ou um personalizado definido nas propriedades de grupo.

source: Additional linker flags for this target.
pt_br: Sinalizadores para vinculador adicionais para este alvo.

source: Additional libraries:
pt_br: Bibliotecas adicionais:

source: Additional libraries for this target.
pt_br: Bibliotecas adicionais para este alvo

source: Additional objects:
pt_br: Objetos adicionais:

source: Additional object files for this target.
pt_br: Arquivos objeto adicionais para este alvo

source: Additional C preprocessor flags for this target.
pt_br: Sinalizadores para pré-processador C adicionais para este alvo.

source: Additional C compiler flags for this target.
pt_br: Sinalizadores para compilador C adicionais para este alvo.

source: Additional C++ compiler flags for this target.
pt_br: Sinalizadores para compilador C++ adicionais para este alvo.

source: Additional Java compiler flags for this target.
pt_br: Sinalizadores para compilador Java adicionais para este alvo.

source: Additional Vala compiler flags for this target.
pt_br: Sinalizadores para compilador Vala adicionais para este alvo.

source: Additional Fortran compiler flags for this target.
pt_br: Sinalizadores para compilador Fortran adicionais para este alvo.

source: Additional Objective C compiler flags for this target.
pt_br: Sinalizadores para compilador Objective C adicionais para este alvo.

source: Additional Lex or Flex lexical analyser generator flags for this target.
pt_br: Sinalizadores para gerador de analisador léxico Lex ou Flex adicionais para este alvo.

source: Additional Yacc or Bison parser generator flags for this target.
pt_br: Sinalizadores para gerador de analisador Yacc ou Bison adicionais para este alvo.

source: Additional dependencies:
pt_br: Dependências adicionais:

source: Additional dependencies for this target.
pt_br: Dependências adicionais para este alvo.

source: Include in distribution:
pt_br: Incluir na distribuição:

source: Include this target in the distributed package.
pt_br: Inclui este alvo no pacote distribuído.

source: Build for check only:
pt_br: Compilar apenas para verificação:

source: Build this target only when running automatic tests.
pt_br: Compila este alvo somente ao executar testes automáticos.

source: Do not use prefix:
pt_br: Não usar prefixo:

source: Do not rename the target with an optional prefix, used to avoid overwritting system program.
pt_br: Não renomeia o alvo com um prefixo adicional, usado para evitar sobrescrita de programas do sistema.

source: Keep target path:
pt_br: Manter caminho do alvo:

source: Keep relative target path for installing it. By example if you have a program subdir/app installed in bin directory it will be installed in bin/subdir/app not in bin/app.
pt_br: Mantém o caminho relativo do alvo para sua instalação. Por exemplo, se você tem um programa subdir/aplicativo instalado no diretório bin, ele será instalado no bin/subdir/aplicativo e não em bin/aplicativo.

source: Manual section:
pt_br: Seção do manual:

source: Section where are installed the man pages. Valid section names are the digits ‘0’ through ‘9’, and the letters ‘l’ and ‘n’.
pt_br: Seção em que serão instaladas as páginas man. Nome válidos de sessão são os dígitos "0" a "9" e as letras "l" e "n".

source: Add Files:
pt_br: Adicionar arquivos:

source: Remote name:
pt_br: Nome remoto:

source: Mailbox files to apply:
pt_br: Arquivos de caixa de mensagens para aplicar:

source: Branches
pt_br: Ramos

source: Drop or enter revision here
pt_br: Remover ou inserir revisão aqui

source: Commit to cherry pick:
pt_br: Fazer o commit no cherry pick:

source: Append signed-of- by line
pt_br: Adiciona linha signed-of-by

source: Repository head; Drop or type a different revision here
pt_br: Redefine o head; Remova ou insira uma revisão diferente aqui

source: Annotate this tag:
pt_br: Anotar esta etiqueta:

source: Whole project; Drop a file here or type a path to view a file or folder log
pt_br: Projeto inteiro; Remova um arquivo aqui, ou digite um caminho para ver um arquivo ou pasta de log

source: Whole project; Drop a file here to view a file or folder log
pt_br: Projeto inteiro; Remova um arquivo aqui para ver um arquivo ou pasta de log

source: Revision to merge with:
pt_br: Revisão para mesclar com:

source: Use a custom log message:
pt_br: Use uma mensagem de log personalizada:

source: Repository origin; Drop or type a different revision here
pt_br: Redefine o origin; Remova ou insira uma revisão diferente aqui

source: Branches:
pt_br: Ramos

source: Tags:
pt_br: Etiquetas:

source: Remote Repositories:
pt_br: Repositório remoto:

source: Remove Files:
pt_br: Remover arquivos:

source: Previous commit; Drop or enter a different revision here
pt_br: Commit anterior; remova ou insira uma versão diferente aqui

source: Drop or type a revision here
pt_br: Remover ou digitar uma revisão aqui

source: Stash Message (Optional):
pt_br: Mensagem de Stash (opcional):

source: Stashed Changes:
pt_br: Alterações no Stash:

source: Repository Status:
pt_br: Status do repositório:

source: Add Files
pt_br: Adicionar arquivos

source: Please enter a remote name.
pt_br: Por favor, digitar um nome remoto.

source: Please enter a URL
pt_br: Por favor, digite um URL.

source: Add Remote
pt_br: Adicionar remoto

source: Apply Mailbox Files
pt_br: Aplicar arquivos da caixa de mensagens

source: No stash selected.
pt_br: Nenhum stash selecionado.

source: Please enter a log message.
pt_br: Por favor, digite uma mensagem de log.

source: Please enter the commit author's name
pt_br: Por favor, digite o nome do autor do commit.

source: Uncommitted Changes.diff
pt_br: Alteracoes sem commit.diff

source: No revision selected
pt_br: Nenhuma revisão selecionada

source: Reset
pt_br: Redefinir

source: Please enter a commit.
pt_br: Por favor, insira um commit.

source: Revert
pt_br: Reverter

source: No remote selected.
pt_br: Nenhum remoto selecionado.

source: No tags selected.
pt_br: Nenhuma etiqueta selecionada.

source: Git Error
pt_br: Erro do Git

source: Git Warning
pt_br: Aviso do Git

source: Generate Patch Series
pt_br: Gerar uma série de patches

source: No remote selected
pt_br: Nenhum remoto selecionado

source: Remove Files
pt_br: Remover arquivos

source: Selected Remote:
pt_br: Remoto selecionado:

source: No remote selected; using origin by default. To push to a different remote, select one from the Remotes list above.
pt_br: Nenhum remoto selecionado; usando origin por padrão. Para fazer push para um remoto diferente, selecione um da lista de remotos acima.

source: No conflicted files selected.
pt_br: Sem arquivos em conflito selecionados.

source: Changes to be committed
pt_br: Alterações para fazer commit

source: Changed but not updated
pt_br: Alterado mas não atualizado

source: No staged files selected.
pt_br: Sem arquivos staged selecionados.

source: Branch tools
pt_br: Ferramentas de Branch

source: Delete selected branches
pt_br: Apagar branches selecionados

source: Switch to the selected branch
pt_br: Alternar para o branch selecionado

source: Merge a revision into the current branch
pt_br: Mesclar uma revisão para o branch atual

source: Tag tools
pt_br: Ferramentas de etiqueta

source: Delete selected tags
pt_br: Apagar etiquetas selecionadas

source: Changes
pt_br: Alterações

source: Commit changes
pt_br: Fazer commit de alterações

source: Diff uncommitted changes
pt_br: Diff das alterações sem commit

source: Show a diff of uncommitted changes in an editor
pt_br: Mostra um diff de alterações sem commit em um editor

source: Add files to the index
pt_br: Adicionar arquivos para um índice

source: Revert changes in unstaged files
pt_br: Reverter alterações em arquivos unstaged

source: Remove staged files from the index
pt_br: Remove arquivos staged de um índice

source: Resolve conflicts
pt_br: Resolver conflitos

source: Mark selected conflicted files as resolved
pt_br: Marca arquivos em conflito como resolvidos

source: Remote repository tools
pt_br: Ferramenta de repositório remoto

source: Add a remote
pt_br: Adicionar um remoto

source: Add a remote repository
pt_br: Adicionar um repositório remoto

source: Delete selected remote
pt_br: Apagar remoto selecionado

source: Delete a remote
pt_br: Apagar um remoto

source: Pull changes from a remote repository
pt_br: Faz pull das alterações para um repositório remoto

source: Fetch
pt_br: Obter

source: Fetch changes from remote repositories
pt_br: Obter as alterações para um repositório remoto

source: Rebase against selected remote
pt_br: Fazer rebase em comparação ao remoto selecionado

source: Start a rebase operation relative to the selected remote repository
pt_br: Iniciar uma operação de rebase relativa ao repositório remoto selecionado

source: Continue
pt_br: Continuar

source: Continue a rebase with resolved conflicts
pt_br: Continuar uma operação de rebase com os conflitos resolvidos

source: Skip
pt_br: Pular

source: Skip the current revision
pt_br: Pular a revisão atual

source: Abort
pt_br: Abortar

source: Abort the rebase and return the repository to its previous state
pt_br: Abortar o rebase e voltar o repositório no seu estado anterior

source: Stash tools
pt_br: Ferramentas de stash

source: Stash uncommitted changes
pt_br: Fazer stash das alterações sem commit

source: Save uncommitted changes without committing them
pt_br: Salva alterações sem commit sem fazer commit delas

source: Apply selected stash
pt_br: Aplicar o stash selecionado

source: Apply stashed changes back into the working tree
pt_br: Aplica alterações do stash de volta na árvore de trabalho

source: Apply stash and restore index
pt_br: Aplica alterações do stash e restaurar índice
